---
kind: property
id: P:Autodesk.Revit.DB.IFCExportOptions.FileVersion
source: html/9be54a3a-819c-0153-24dc-05a8624e81f1.htm
---
# Autodesk.Revit.DB.IFCExportOptions.FileVersion Property

IFC file version.

## Syntax (C#)
```csharp
public IFCVersion FileVersion { get; set; }
```

## Remarks
Default is IFCVersion.Default.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration